Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskExecutor.GetOutputSchemaId
Since:
2027

Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskExecutor.GetInputSchemaId
Since:
2027

Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskExecutor.ProcessInput(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExtensibleStorage.Entity)
document:
The snapshot document
inputData:
Necessary data to complete the task
Returns:
Combines the output data of the class, and a status to indicate
whether the task was able to finish successfully.
Since:
2027

Autodesk.Revit.DB.BackgroundProcessTask.IBackgroundProcessTaskExecutor
IBackgroundProcessTaskWorker takes the input data from main process,
and runs the defined task in a background worker process
Since:
2027